
//Написать программу которая на вход принимает 2 числа
// проверяет кратность одного другому и выводит остаток деления.
Console.WriteLine("Введите 2 числа:");
int a = Convert.ToInt32(Console.ReadLine());
int b = Convert.ToInt32(Console.ReadLine());
int result = a/b;
        
        
